from PIL import Image


dictRusDecode = {'а': 0, 'б': 1, 'в': 2, 'г': 3, 'д': 4, 'е': 5, 'ё': 6, 'ж': 7,
                 'з': 8, 'и': 9, 'й': 10, 'к': 11, 'л': 12, 'м': 13, 'н': 14, 'о': 15,
                 'п': 16, 'р': 17, 'с': 18, 'т': 19, 'у': 20, 'ф': 21, 'х': 22, 'ц': 23,
                 'ч': 24, 'ш': 25, 'щ': 26, 'ъ': 27, 'ы': 28, 'ь': 29, 'э': 30, 'ю': 31, 'я': 32, '№': 33,
                 'А': 34, 'Б': 35, 'В': 36, 'Г': 37, 'Д': 38, 'Е': 39, 'Ё': 40, 'Ж': 41,
                 'З': 42, 'И': 43, 'Й': 44, 'К': 45, 'Л': 46, 'М': 47, 'Н': 48, 'О': 49,
                 'П': 50, 'Р': 51, 'С': 52, 'Т': 53, 'У': 54, 'Ф': 55, 'Х': 56, 'Ц': 57,
                 'Ч': 58, 'Ш': 59, 'Щ': 60, 'Ъ': 61, 'Ы': 62, 'Ь': 63, 'Э': 64, 'Ю': 65, 'Я': 66}

dictEngDecode = {'a': 0, 'b': 1, 'c': 2, 'd': 3, 'e': 4, 'f': 5, 'g': 6, 'h': 7,
                'i': 8, 'j': 9, 'k': 10, 'l': 11, 'm': 12, 'n': 13, 'o': 14, 'p': 15,
                'q': 16, 'r': 17, 's': 18, 't': 19, 'u': 20, 'v': 21, 'w': 22, 'x': 23,
                'y': 24, 'z': 25, 'A': 26, 'B': 27, 'C': 28, 'D': 29, 'E': 30, 'F': 31, 'G': 32, 'H': 33,
                'I': 34, 'J': 35, 'K': 36, 'L': 37, 'M': 38, 'N': 39, 'O': 40, 'P': 41,
                 'Q': 42, 'R': 43, 'S': 44, 'T': 45, 'U': 46, 'V': 47, 'W': 48, 'X': 49,
                 'Y': 50, 'Z': 51, '!': 52, '?': 62, '-': 67, '+': 69, '=': 70,
                 ',': 71, '.': 73,
                 '0': 83, '1': 84, '2': 85, '3': 86, '4': 87, '5': 88, '6': 89, '7': 90, '8': 91,
                 '9': 92, ' ': 93, '\n': 94}

dictRusEncode = {0: 'a', 1: 'б', 2: 'в', 3: 'г', 4: 'д', 5: 'е', 6: 'ё', 7: 'ж',
                 8: 'з', 9: 'и', 10: 'й', 11: 'к', 12: 'л', 13: 'м', 14: 'н', 15: 'о',
                 16: 'п', 17: 'р', 18: 'с', 19: 'т', 20: 'у', 21: 'ф', 22: 'х', 23: 'ц',
                 24: 'ч', 25: 'ш', 26: 'щ', 27: 'ъ', 28: 'ы', 29: 'ь', 30: 'э', 31: 'ю', 32: 'я', 33: '№',
                 34: 'А', 35: 'Б', 36: 'В', 37: 'Г', 38: 'Д', 39: 'Е', 40: 'Ё', 41: 'Ж',
                 42: 'З', 43: 'И', 44: 'Й', 45: 'К', 46: 'Л', 47: 'М', 48: 'Н', 49: 'О',
                 50: 'П', 51: 'Р', 52: 'С', 53: 'Т', 54: 'У', 55: 'Ф', 56: 'Х', 57: 'Ц',
                 58: 'Ч', 59: 'Ш', 60: 'Щ', 61: 'Ъ', 62: 'Ы', 63: 'Ь', 64: 'Э', 65: 'Ю', 66: 'Я'}

dictEngEncode = {0: 'a', 1: 'b', 2: 'c', 3: 'd', 4: 'e', 5: 'f', 6: 'g', 7: 'h',
                 8: 'i', 9: 'j', 10: 'k', 11: 'l', 12: 'm', 13: 'n', 14: 'o', 15: 'p',
                 16: 'q', 17: 'r', 18: 's', 19: 't', 20: 'u', 21: 'v', 22: 'w', 23: 'x',
                 24: 'y', 25: 'z', 26: 'A', 27: 'B', 28: 'C', 29: 'D', 30: 'E', 31: 'F',
                 32: 'G', 33: 'H', 34: 'I', 35: 'J', 36: 'K', 37: 'L', 38: 'M', 39: 'N', 40: 'O', 41: 'P',
                 42: 'Q', 43: 'R', 44: 'S', 45: 'T', 46: 'U', 47: 'V', 48: 'W', 49: 'X',
                 50: 'Y', 51: 'Z', 52: '!',
                 62: '?', 67: '-', 69: '+', 70: '=',
                 71: ',', 73: '.',
                 83: '0', 84: '1', 85: '2', 86: '3', 87: '4', 88: '5', 89: '6', 90: '7', 91: '8',
                 92: '9', 93: ' '}

choice = int(input('1 - закодировать текст, 2 - раскодировать: '))
name = input('Введите название пикчи: ')
string = ''
img = Image.open(name)
x, y = img.size

if choice == 1:  # закодировать
    string = input('Введите текст: ')
    k = len(string)  # количество символов в слове
    img.putpixel((x - 1, y - 1), (k // 100, k // 10 % 10, k % 10))  # установить в последний пиксель количество символов

    for i in range(len(string)):
        pix0 = img.getpixel((0, i))[0]  # R коэффициент
        pix1 = img.getpixel((0, i))[1]  # G коэффициент
        pix2 = img.getpixel((0, i))[2]  # B коэффициент
        lang = ord(string[i])  # берем unicode символа
        if lang < 256:  # < 256, значит, он анлг по unicode
            r = pix0 // 10 * 10 + 5  # ставим код словаря в единицы
            g = pix1 // 10 * 10 + dictEngDecode[string[i]] // 10
            b = pix2 // 10 * 10 + dictEngDecode[string[i]] % 10
            img.putpixel((0, i), (r, g, b))
        #  else:  # кодируем так же русские символы
        #    r = pix0 // 10 * 10 + 6
        #    g = pix1 // 10 * 10 + dictRusDecode[string[i]] // 10
        #    b = pix2 // 10 * 10 + dictRusDecode[string[i]] % 10
        #    img.putpixel((0, i), (r, g, b))
    img.save(input('Введите название новой пикчи: '), 'png')
    print('пикча создана')
    img.show()

elif choice == 2:
    answer = ''  # будем собирать закодированное слово
    pixelK = img.getpixel((x - 1, y - 1))
    k = pixelK[0] * 100 + pixelK[1] * 10 + pixelK[2]  # узнаем количество символов

    for i in range(k):
        pix0 = img.getpixel((0, i))[0]
        pix1 = img.getpixel((0, i))[1]
        pix2 = img.getpixel((0, i))[2]
        langWord = pix0 % 10  # у R берем код словаря

       # if langWord == 5:
        answer += dictEngEncode[pix1 % 10 * 10 + pix2 % 10]
        #else:
         #   answer += dictRusEncode[pix1 % 10 * 10 + pix2 % 10]

    print(f'Слово: {answer}')
